/**
 * 此文件由后台服务生成，请勿手工维护
 */
export const consts = {
    enum: {
        FILETYPE: '100001', //文件类型100001
        FIELDTYPE: '100004', //字段类型100004
        ALIGNTYPE: '100005', //对齐方式100005
        ORDERMODE: '100006', //排序方式100006
    },

    FILETYPE_pic: '1000010001',  // 文件类型:  1000010001: 图片
    FILETYPE_word: '1000010002',  // 文件类型:  1000010002: word
    FILETYPE_excel: '1000010003',  // 文件类型:  1000010003: excel
    FILETYPE_ppt: '1000010004',  // 文件类型:  1000010004: ppt
    FILETYPE_pdf: '1000010005',  // 文件类型:  1000010005: pdf
    FILETYPE_zip: '1000010006',  // 文件类型:  1000010006: 压缩包
    FILETYPE_other: '1000019999',  // 文件类型:  1000019999: 其他
    GENDER_male: '3000020001',  // 性别:  3000020001: 男
    GENDER_female: '3000020002',  // 性别:  3000020002: 女

}